export const issues = [
	'проживание эмоционально сложных и стрессовых ситуаций',
	'тревога и дискомфорт, отсутствие сил',
	'выстраивание планов на жизнь и карьеру, мотивация',
	'эмоциональное выгорание',
	'помощь в понимании себя: своих эмоций, потребностей и желаний',
	'низкая самооценка',
	'проблемы с личными границами',
	'одиночество, выстраивание отношений, коммуникация с партнёром, семьёй, друзьями',
	'депрессивные состояния и клиническая депрессия',
	'социальная тревога'
];

export const aboutItems = [
	'7 лет работал в IT-индустрии перед тем, как стать психологом, пережил классическое выгорание с полным набором симптомов',
	'параллельно с работой получил психологическое образование, чтобы потом помогать другим',
	'специализируюсь на помощи digital и IT-специалистам, которые чувствуют, что двигаются не в том направлении, даже если внешне все выглядит хорошо',
	'в работе применяю методы с доказанной эффективностью',
	'использую систему измерения прогресса, чтобы наша работа приводила к конкретным результатам, систему измерения обратной связи, чтобы понимать, когда в работе что-то идет не так',
	'уверен, что устойчивый результат требует времени'
];

export const consultationInfo = {
	format: 'Встречи проходят онлайн',
	duration: 'Длительность — 50 минут',
	price: 'Стоимость — 5000 рублей'
};
