export interface FaqItem {
	question: string;
	answer: string;
}

export const faqItems: FaqItem[] = [
	{
		question: 'как понять, что мне нужен психолог?',
		answer:
			'Если проблемы не решаются самостоятельно долгое время или вы чувствуете, что вам плохо или что-то идет не так — психотерапия может помочь найти выход. Обращение к психологу — не признак слабости, а проявление заботы о своем благополучии, как регулярные визиты к стоматологу или занятия фитнесом.'
	},
	{
		question: 'как записаться на сессию?',
		answer:
			'Ознакомьтесь с [памяткой о работе](/online-therapy).\n\nПосле этого напишите мне в [WhatsApp](https://api.whatsapp.com/send?phone=79065378241) или [Telegram](https://t.me/psy_kalmykov), где мы подберём комфортное для вас время для сессии.'
	},
	{
		question: 'можно ли сначала познакомиться?',
		answer:
			'Первая встреча нужна именно для этого. Вы оцените, комфортно ли вам со мной, а я пойму, смогу ли помочь с вашим запросом. Это время для взаимного знакомства и создания доверительного пространства. Послушать, как я говорю, можно [здесь](https://t.me/kalmykov_psy/217), а посмотреть [здесь](https://t.me/kalmykov_psy/262).'
	},
	{
		question: 'как часто нужно посещать психолога?',
		answer:
			'Обычно раз в неделю. Это поддерживает терапевтический процесс и дает время для осмысления между встречами. Но вместе мы можем подобрать подходящий для вас ритм.'
	},
	{
		question: 'что делать, если цена высока?',
		answer:
			'Можем обсудить менее частые встречи. Также я могу порекомендовать коллег с более доступными ценами.'
	},
	{
		question: 'что если я буду нервничать на сессии?',
		answer:
			'Волнение перед первой встречей — абсолютно нормально. Многие испытывают тревогу в начале. С пониманием отнесусь к этому и помогу комфортно начать разговор через простые вопросы или спокойные темы.'
	},
	{
		question: 'дадите ли конкретные советы?',
		answer:
			'Я не могу дать вам советов, так как не знаю полной картины вашей жизни, и не несу ответственность за нее.\n\nМоя забота — помочь вам найти собственные решения, учитывающие все особенности вашей ситуации, приоритеты, жизненный опыт.\n\nСамостоятельно найденные решения работают эффективнее любых советов, потому что они действительно ваши.'
	},
	{
		question: 'как быстро будут результаты?',
		answer:
			'Скорость изменений индивидуальна. Некоторые проблемы решаются за одну сессию, некоторые за год. Обычно первые 2-4 встреч — это бережное создание «карты маршрута». Затем идет период освоения новых способов справляться с трудностями и время для закрепления работающих именно для вас методов.'
	},
	{
		question: 'я не могу сформулировать запрос, это обязательно?',
		answer:
			'Достаточно общего понимания того, что вас беспокоит. В процессе наших встреч мы вместе проясним детали и сформулируем задачу. Если и это не понятно — так же проясним в процессе.'
	},
	{
		question: 'боюсь осуждения',
		answer: 'На сессиях нет места осуждению.'
	},
	{
		question: 'что делать при проблемах с интернетом?',
		answer:
			'Воспользуемся запасным вариантом связи. Рекомендую проверить соединение заранее и найти тихое место, где никто не помешает вашей встрече.'
	},
	{
		question: 'нужно ли включать камеру?',
		answer:
			'Да, это помогает наладить живой контакт и видеть важные невербальные реакции. Это делает нашу работу более эффективной.'
	},
	{
		question: 'нужно ли как-то готовиться?',
		answer:
			'Чтобы сессия прошла комфортно и эффективно, убедитесь, что у вас есть место для консультации, где никто не сможет вас потревожить, а ваши уведомления о входящих сообщениях и звонках отключены, чтобы не мешали вам сосредоточиться.'
	},
	{
		question: 'есть темы, о которых стесняюсь говорить',
		answer:
			'Делитесь только тем, к чему готовы, в своем темпе. С укреплением доверия становится легче обсуждать сложные темы. Ваши переживания, какими бы необычными они ни казались, для меня — часть бесценного человеческого опыта, которому есть место в терапии.'
	},
	{
		question: 'я не связан с IT, вы можете мне помочь?',
		answer:
			'Конечно! Я работаю с людьми самых разных профессий и сфер деятельности. Принципы эмоционального благополучия и построения здоровых отношений применимы к каждому, независимо от профессии.'
	}
];
