export interface BlockProps {
	title: string;
	data: string[];
}

export const onlineTherapyBlocks: BlockProps[] = [
	{
		title: 'С чего начать',
		data: [
			'Прочитайте эту памятку, затем напишите мне. Отвечу на вопросы, если они есть, выберем время, проведём первую встречу.'
		]
	},
	{
		title: 'Записаться на сессию',
		data: [
			'Напишите мне в [Telegram](https://t.me/m/POBhzGjVOWFi) или [забронируйте время сессии](https://kalmykov-psy.ru/booking/), и я свяжусь с вами.'
		]
	},
	{
		title: 'Где проходит сессия',
		data: [
			'Онлайн через Яндекс Телемост. Пришлю ссылку перед встречей. Работает в браузере, не обязательно устанавливать приложение.'
		]
	},
	{
		title: 'Что происходит на сессии',
		data: [
			'На первой встрече мы познакомимся, я расскажу подробнее о формате работы, и мы обсудим вашу ситуацию. Не нужно специально готовиться.',
			'Я внимательно веду беседу, задаю вопросы, чтобы лучше понять ваш запрос, вы можете свободно выражать свои мысли и чувства.',
			'Многие испытывают тревогу в начале работы, это естественная реакция на новый опыт.',
			'На следующих встречах мы уточняем цель н а терапию и пытаемся достичь желаемых изменений.',
			'Терапия — совместная работа. Я отвечаю за ведение встречи, внимательность, предложение техник, наблюдение за вами и обсуждение моих наблюдений. Вы отвечаете за выбор запроса, выводы, решения и изменения в вашей жизни.'
		]
	},
	{
		title: 'Продолжительность сессии',
		data: ['50 минут, включая сбор обратной связи.']
	},
	{
		title: 'Частота встреч',
		data: ['Рекомендуемый формат — раз в неделю.']
	},

	{
		title: 'Оплата и стоимость',
		data: [
			'**100% предоплата за 24 часа до сессии.**',
			'Об изменении цены предупрежу за месяц.'
		]
	},
	{
		title: 'Опоздания и переносы',
		data: [
			'При опоздании я буду вас ждать, сессия сокращается на время опоздания.',
			'**Перенесенная или отмененная сессия оплачивается, если перенос был менее, чем за 24 часа.**',
			'Если я переношу сессию меньше чем за 24 часа, проведу дополнительную бесплатную сессию.'
		]
	},

	{
		title: 'Отпуск',
		data: ['О своем отпуске предупрежу минимум за неделю.']
	},
	{
		title: 'Конфиденциальность',
		data: [
			'Во время сессии делаю заметки.',
			'Храню в тайне информацию, которую вы рассказываете. Исключение — угроза жизни.',
			'Периодически я **записываю сессии для обсуждения их с супервизором** — более опытным коллегой. Это помогает мне развиваться и лучше поддерживать вас.',
			'Запись удаляется сразу после обсуждения. Выбираю сессии для записи случайно, в начале сессии оповещу вас об этом.'
		]
	},
	{
		title: 'Нейтральность и принятие',
		data: [
			'На протяжении работы сохраняю нейтральность. Не осуждаю ваши мысли, чувства и действия. Вы можете свободно говорить обо всё, о чём посчитаете нужным и важным.'
		]
	},
	{
		title: 'Этические принципы',
		data: [
			'Работаю в соответствии с моими знаниями, навыками и опытом, с заботой о вашем благополучии. Если моих знаний недостаточно, порекомендую другого специалиста.',
			'Оказываю только психологические услуги и не получаю от вас услуг.',
			'Не общаюсь с вами вне сессий. Если случайно встретимся за пределами сессии, не буду здороваться первым, сохраняя вашу приватность.',
			'Я не интересуюсь вашей жизнью и окружением за пределами терапии. Не ищу и изучаю ваши соцсети.',
			'Не работаю с вашими близкими.'
		]
	},
	{
		title: 'Длительность работы',
		data: [
			'Заранее сложно оценить продолжительность работы.',
			'Длительность зависит от ваших потребностей, целей и особенностей личности, комфорта в нашей работе и времени, которое вы готовы уделять терапии.',
			'Составим план и оценим время достижения целей совместно.'
		]
	},
	{
		title: 'Завершение работы',
		data: [
			'Можете закончить в любой момент, когда почувствуете в этом потребность.',
			'Рекомендую посвятить хотя бы одну встречу осмысленному завершению терапии и подведению итогов.',
			'Можно вернуться в терапию в любой момент, если будет открыта запись.',
			'Могу завершить работу с вами, если почувствую, что у меня не получится качественно вам помочь, либо при нарушении пунктов этого согласия.'
		]
	},
	{
		title: 'Обратная связь',
		data: [
			'Использую шкалы для отслеживания самочувствия и обратной связи. Мы вместе заполняем их каждую сессию.',
			'Приветствую любую обратную связь в свободной форме — это помогает нам сделать совместную работу максимально полезной для вас.'
		]
	}
];
